id: pwpolicy_account_lockout_timeout_enforce_1
title: "Set Account Lockout Time to 1 Minute"
discussion: |
  The macOS should be configured to enforce a lockout time period of at least 1 minute when the maximum number of failed logon attempts is reached.

  This rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. 
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'minutesUntilFailedLoginReset = 1' 
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85085-9
  cci: 
    - N/A
  800-53r4: 
    - CM-2
    - AC-7
  srg: 
    - N/A
  disa_stig: 
    - N/A
  800-171r2:
    - N/A
  800-63B:
    - 5.1.1.2
macOS:
  - "11.0"
tags:
  - 800-179_standalone
  - 800-179_managed
  - 800-179_sslf
  - preliminary
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minutesUntilFailedLoginReset: 1
