id: sysprefs_automatically_install_os_updates
title: "Enable the automatic installation of macOS updates"
discussion: |
  Automatic macOS updates must be enabled. 

  Updates should be tested and vetted before being deployed. In the absense of such a process, install updates as soon as possible.
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'AutomaticallyInstallMacOSUpdates = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85096-6
  cci:
    - N/A
  800-53r4:
    - CM-2
  srg:
    - N/A
  disa_stig:
    - N/A
  800-171r2:
    - N/A
macOS:
  - "11.0"
tags:
  - 800-179_standalone
  - preliminary
mobileconfig: true
mobileconfig_info:
  com.apple.SoftwareUpdate:
    AutomaticallyInstallMacOSUpdates: true
