id: sysprefs_gatekeeper_app_store_only
title: "Apply Gatekeeper Settings to Allow Only Mac App Store Apps"
discussion: |
  The information system implements cryptographic mechanisms to authenticate software prior to installation.
  
  Gatekeeper settings must be configured correctly to only allow the system to run applications downloaded from the Mac App Store. Administrator users will still have the option to override these settings on a per-app basis. Gatekeeper is a security feature that ensures that applications must be digitally signed by an Apple-issued certificate in order to run. Digital signatures allow the macOS to verify that the application has not been modified by a malicious third party.
check: |
  /usr/sbin/spctl --status --verbose | /usr/bin/grep -Ec '(developer id disabled|assessments enabled)'
result: 
  integer: 2
fix: |
  [source,bash]
  ----
  /usr/sbin/spctl --master-enable
  ----
references:
  cce:
    - CCE-85077-6
  cci: 
    - n/a
  800-53r4: 
    - CM-2
    - CM-11
  srg: 
    - n/a
  disa_stig: 
    - n/a
  800-171r2:
    - n/a
macOS:
  - "11.0"
tags:
  - 800-179_sslf
  - preliminary
mobileconfig: true
mobileconfig_info:
  com.apple.systempolicy.control:
    AllowIdentifiedDevelopers: false
    EnableAssessment: true
